AxDen-Dev/NRF52_Smart_ECG_PPG_example/main.c
	}

}

static void twi_init(void) {

	ret_code_t err_code;

	const nrf_drv_twi_config_t twi_config =
			{ .scl = I2C_SCL_GPIO, .sda = I2C_SDA_GPIO, .frequency =
					NRF_DRV_TWI_FREQ_400K, .interrupt_priority =
					APP_IRQ_PRIORITY_HIGH, .clear_bus_init = false };

	err_code = nrf_drv_twi_init(&m_twi, &twi_config, twi_handler, NULL);
	APP_ERROR_CHECK(err_code);

	nrf_drv_twi_enable(&m_twi);

}

static void spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context) {

	spi_xfer_done = 0x01;

}

static void spi_init() {

	ret_code_t err_code;

	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	spi_config.ss_pin = SPI_CS_GPIO;
	spi_config.miso_pin = SPI_MISO_GPIO;
	spi_config.mosi_pin = SPI_MOSI_GPIO;
	spi_config.sck_pin = SPI_SCK_GPIO;
	spi_config.orc = 0xFF;
	spi_config.frequency = NRF_DRV_SPI_FREQ_4M;
	spi_config.mode = NRF_DRV_SPI_MODE_0;
	spi_config.bit_order = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;

	err_code = nrf_drv_spi_init(&m_spi, &spi_config, spi_event_handler, NULL);
	APP_ERROR_CHECK(err_code);

}

static void uart_event_handle(app_uart_evt_t *p_event) {

	switch (p_event->evt_type) {

	case APP_UART_DATA_READY: {
		uint8_t data;
		UNUSED_VARIABLE(app_uart_get(&data));

	}

		break;

	case APP_UART_DATA: {
		uint8_t data;
		UNUSED_VARIABLE(app_uart_get(&data));

		break;

	}

	case APP_UART_COMMUNICATION_ERROR: {

		NRF_LOG_ERROR("COMM ERROR");
		app_uart_flush();

	}
		break;

	case APP_UART_FIFO_ERROR: {

		NRF_LOG_ERROR("FIFO ERROR");
		app_uart_flush();

	}
		break;

	default:
		break;
	}

}

static void init_uart_1() {

	uint32_t err_code;

	const app_uart_comm_params_t comm_params = { .rx_pin_no = UART_1_RX_GPIO,
			.tx_pin_no = UART_1_TX_GPIO, UART_PIN_DISCONNECTED,
			UART_PIN_DISCONNECTED, .flow_control =
					APP_UART_FLOW_CONTROL_DISABLED, .use_parity = false,
			NRF_UART_BAUDRATE_9600 };

	APP_UART_FIFO_INIT(&comm_params, 256, 256, uart_event_handle,
			APP_IRQ_PRIORITY_LOWEST, err_code);

	APP_ERROR_CHECK(err_code);

}

#ifdef NRF528XX_FEM

void fem_init(void) {

	ret_code_t err_code;
	ble_opt_t opt;
	uint32_t gpiote_ch;
	nrf_ppi_channel_t ppi_set_ch;
	nrf_ppi_channel_t ppi_clr_ch;
	nrf_drv_gpiote_out_config_t config = GPIOTE_CONFIG_OUT_TASK_TOGGLE(false);

	nrf_gpio_cfg_output(FEM_ANT_SEL);
	nrf_gpio_pin_clear(FEM_ANT_SEL);

	nrf_gpio_cfg_output(FEM_CSD);
	nrf_gpio_pin_set(FEM_CSD);

	nrf_gpio_cfg_output(FEM_CHL);
	nrf_gpio_pin_set(FEM_CHL);

	nrf_gpio_cfg_output(FEM_CPS);

	nrf_gpio_pin_clear(FEM_CPS);

	nrf_gpio_cfg_output(FEM_CTX);
	nrf_gpio_pin_clear(FEM_CTX);

	nrf_gpio_cfg_output(FEM_CRX);
	nrf_gpio_pin_clear(FEM_CRX);

	err_code = nrf_drv_gpiote_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_channel_alloc(&ppi_set_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_ppi_channel_alloc(&ppi_clr_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_gpiote_out_init(FEM_CRX, &config);
	APP_ERROR_CHECK(err_code);

	gpiote_ch = nrf_drv_gpiote_out_task_addr_get(FEM_CRX);

	memset(&opt, 0, sizeof(ble_opt_t));
	opt.common_opt.pa_lna.gpiote_ch_id = (gpiote_ch - NRF_GPIOTE_BASE) >> 2; // GPIOTE channel used for radio pin toggling
	opt.common_opt.pa_lna.ppi_ch_id_clr = ppi_clr_ch; // PPI channel used for radio pin clearing
	opt.common_opt.pa_lna.ppi_ch_id_set = ppi_set_ch; // PPI channel used for radio pin setting

	opt.common_opt.pa_lna.pa_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.pa_cfg.enable = 1;              // Enable toggling
	opt.common_opt.pa_lna.pa_cfg.gpio_pin = FEM_CTX; // The GPIO pin to toggle

	opt.common_opt.pa_lna.lna_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.lna_cfg.enable = 1;             // Enable toggling
	opt.common_opt.pa_lna.lna_cfg.gpio_pin = FEM_CRX; // The GPIO pin to toggle

	err_code = sd_ble_opt_set(BLE_COMMON_OPT_PA_LNA, &opt);
	APP_ERROR_CHECK(err_code);

}

#endif

static void gpio_init() {

	nrf_gpio_cfg_output(GPIO_LED_0);
	nrf_gpio_pin_clear(GPIO_LED_0);

	nrf_gpio_cfg_output(GPIO_LED_1);
	nrf_gpio_pin_clear(GPIO_LED_1);

	nrf_gpio_cfg_output(GPIO_BAT_EN);
	nrf_gpio_pin_clear(GPIO_BAT_EN);

	nrf_gpio_cfg_output(GPIO_SENSOR_POWER_EN);
	nrf_gpio_pin_clear(GPIO_SENSOR_POWER_EN);

	nrf_gpio_cfg_input(GPIO_BTN, NRF_GPIO_PIN_PULLUP);

}

static void build_event_packet(uint8_t event_type) {

//	uint8_t header_0;
//	uint8_t header_1;
//	uint8_t mac_address[8];
//	uint8_t product_id[2];
//	uint8_t event_value_0;
//	uint8_t event_value_1;

	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_EVENT_HEADER_0;

	node_packet_data.Event_Packet.header_0 = packet_header_0.value;
	node_packet_data.Event_Packet.header_1 = packet_header_1.value;

	memcpy(node_packet_data.Event_Packet.mac_address, mac_address,
			sizeof(mac_address));

	node_packet_data.Event_Packet.product_id[0] = product_id.value >> 8;
	node_packet_data.Event_Packet.product_id[1] = product_id.value;

	packet_event_0.bits.EVENT_TYPE = event_type;
	node_packet_data.Event_Packet.event_value_0 = packet_event_0.value;
	node_packet_data.Event_Packet.event_value_1 = packet_event_1.value;

	node_packet_data_size = NODE_EVENT_PACKET_SIZE;

	NRF_LOG_INFO("build_event_packet");

}

static void build_sensor_data_packet() {

//	uint8_t header_0;
//	uint8_t header_1;
//	uint8_t mac_address[8];
//	uint8_t packet_info; //11Byte
//	uint8_t battery_value;
//	uint8_t temperature[2];
//	uint8_t green_heart_rate;
//	uint8_t green_heart_rate_count;
//	uint8_t ir_heart_rate;
//	uint8_t ir_heart_rate_count;
//	uint8_t spo2;
//	uint8_t spo2_count;
//	uint8_t ecg_heart_rate;
//	uint8_t ecg_heart_rate_count;

	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_SENSOR_DATA_HEADER_0;

