AxDen-Dev/NRF52_Smart_ECG_PPG_example/main.c
	node_packet_data.Data_Packet.header_0 = packet_header_0.value;
	node_packet_data.Data_Packet.header_1 = packet_header_1.value;

	memcpy(node_packet_data.Data_Packet.mac_address, mac_address,
			sizeof(mac_address));

	node_packet_data.Data_Packet.packet_info = (command_id << 4) & 0xF0;
	node_packet_data.Data_Packet.packet_info |= (packet_id & 0x0F);

	node_packet_data.Data_Packet.battery_value = battery_value;

	node_packet_data.Data_Packet.temperature[0] = temperature >> 8;
	node_packet_data.Data_Packet.temperature[1] = temperature;

	node_packet_data.Data_Packet.green_heart_rate = green_heart_rate;
	node_packet_data.Data_Packet.green_heart_rate_count =
			green_heart_rate_count;

	node_packet_data.Data_Packet.ir_heart_rate = ir_heart_rate;
	node_packet_data.Data_Packet.ir_heart_rate_count = ir_heart_rate_count;

	node_packet_data.Data_Packet.spo2 = spo2;
	node_packet_data.Data_Packet.spo2_count = spo2_count;

	node_packet_data.Data_Packet.ecg_heart_rate = ecg_heart_rate;
	node_packet_data.Data_Packet.ecg_heart_rate_count = ecg_heart_rate_count;

	node_packet_data_size = NODE_DATA_PACKET_SIZE;

	packet_id += 1;

	if (packet_id > 0x0F) {

		packet_id = 0;

	}

	NRF_LOG_INFO("build_sensor_data_packet");

}

/**@brief Function for application main entry.
 */
int main(void) {

	uint8_t event_init = 0x00;
	uint8_t event_type = EVENT_TYPE_POWER_ON;

	uint8_t event_packet_ready = 0x00;
	uint8_t sensor_data_packet_ready = 0x00;

	uint8_t battery_read_step = 0x00;

	uint8_t on_off_state = 0x01;
	uint8_t on_off_count = 0;

	uint32_t device_id_0 = NRF_FICR->DEVICEID[1];
	uint32_t device_id_1 = NRF_FICR->DEVICEID[0];

	mac_address[0] = device_id_0 >> 24;
	mac_address[1] = device_id_0 >> 16;
	mac_address[2] = device_id_0 >> 8;
	mac_address[3] = device_id_0;

	mac_address[4] = device_id_1 >> 24;
	mac_address[5] = device_id_1 >> 16;
	mac_address[6] = device_id_1 >> 8;
	mac_address[7] = device_id_1;

	log_init();

	timers_init();

	gpio_init();

	twi_init();

	spi_init();

	init_uart_1();

	power_management_init();

	ble_stack_init();

#ifdef NRF528XX_FEM

	fem_init();

#endif

	gap_params_init();

	gatt_init();

	services_init();

	advertising_init(data_update_state);

	conn_params_init();

	app_timer_start(m_app_timer_id, APP_TIMER_DELAY, NULL);

	/////////////////////// Init Protocol Data /////////////////////

	packet_header_0.value = 0x00;
	packet_header_0.bits.DEVICE_ROLE = 0x00;
	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_EVENT_HEADER_0;
	packet_header_0.bits.CHIP_MANUFACTURER = CHIP_MANUFACTURER_NORDIC;

	packet_header_1.value = 0x00;
	packet_header_1.bits.CHIP_IDENTIFIER = CHIP_IDENTIFIER_NRF52832;
	packet_header_1.bits.COMMUNICATION_TYPE =
	COMMUNICATION_TYPE_BLE_CONNECTION_1M;

	product_id.value = 0x00;
	product_id.bits.PRODUCT_ID = PRODUCT_ID_AA_MB_02;
	product_id.bits.DEVICE_TYPE = 0x00;
	product_id.bits.PRODUCT_TYPE = 0x01;

	packet_event_0.value = 0x00;
	packet_event_0.bits.EVENT_TYPE = EVENT_TYPE_POWER_ON;

	packet_event_1.value = 0x00;

	//////////////////// Start Application ///////////////////

	set_uart_usb_in_out_write_string("Start AxDen Smart ECG PPG example");

	set_uart_usb_in_out_mac_address(mac_address);

	nrf_gpio_pin_set(GPIO_SENSOR_POWER_EN);

	wait_200ms();

	twi_scan();

	set_max30101_i2c_instance(m_twi);

	if (!init_max30101()) {

		packet_event_1.bits.MAX30101_ERROR = 0x01;

	}

	set_si7051_i2c_instance(m_twi);

	if (!init_si7051()) {

		packet_event_1.bits.SI7051_ERROR = 0x01;

	}

	wait_200ms();

	if (!get_si7051_temperature(&temperature)) {

		packet_event_1.bits.SI7051_ERROR = 0x01;

	}

	set_max30003_spi_instance(m_spi);

	uint8_t rev_id = get_max30003_rev_id();

	if (rev_id == 0x00) {

		packet_event_1.bits.MAX30003_ERROR = 0x01;

	} else {

		init_max30003_mode_0();

	}

	NRF_LOG_INFO("MAX30003 REV ID %02X", rev_id);
	NRF_LOG_FLUSH();

	nrf_gpio_pin_set(GPIO_BAT_EN);

	wait_200ms();

	read_battery_level();

	//////////////////// Print Value ///////////////////

	NRF_LOG_INFO("Print sensor value");

	set_uart_usb_in_out_battery(battery_value);

	set_uart_usb_in_out_temperature(temperature);

	//////////////////// Start Main Loop ///////////////////

	event_packet_ready = 0x01;
	data_update_state = 0x01;
	advertising_init(data_update_state);

	advertising_start();

	NRF_LOG_INFO("Start main loop");

	for (;;) {

		if (one_sec_timer_update) {

			if (!nrf_gpio_pin_read(GPIO_BTN)) {

				on_off_count += 1;

				if (on_off_count >= 3) {

					if (on_off_state) {

						event_type = EVENT_TYPE_POWER_OFF;

						NRF_LOG_INFO("EVENT_TYPE_POWER_OFF");

					} else {

						event_type = EVENT_TYPE_POWER_ON;

						NRF_LOG_INFO("EVENT_TYPE_POWER_ON");

					}

					event_init = 0x00;
					event_packet_ready = 0x01;
					data_update_state = 0x01;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();
						gap_params_init();
						advertising_init(data_update_state);
						advertising_start();

					} else {

						sd_ble_gap_disconnect(m_conn_handle,
						BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					}

					on_off_state = !on_off_state;
					on_off_count = 0;

					NRF_LOG_INFO("on_off_state %d", on_off_state);

				}

				nrf_gpio_pin_clear(GPIO_LED_0);

			} else {

				on_off_count = 0;

				nrf_gpio_pin_set(GPIO_LED_0);

			}

			one_sec_timer_update = 0x00;

		}

		if (on_off_state && event_init) {

			if (collection_cycle_update) {

				if (battery_read_step == 0x00) {

					nrf_gpio_pin_set(GPIO_BAT_EN);

					battery_read_step = 0x01;

				} else {

					read_battery_level();

					packet_event_1.bits.SI7051_ERROR = 0x00;

					if (!get_si7051_temperature(&temperature)) {

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						packet_event_1.bits.SI7051_ERROR = 0x01;

						NRF_LOG_INFO("SI7051_ERROR");

					} else {

