AxDen-Dev/NRF52_Smart_ECG_PPG_example/main.c
						NRF_LOG_INFO("temperature %d", temperature);

					}

					nrf_gpio_pin_clear(GPIO_LED_1);

					packet_event_1.bits.MAX30003_ERROR = 0x00;

					if (!update_ECG()) {

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						packet_event_1.bits.MAX30003_ERROR = 0x01;

						NRF_LOG_INFO("MAX30003_ERROR");

					}

					packet_event_1.bits.MAX30101_ERROR = 0x00;

					if (!update_Heartrate_SPO2()) {

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						packet_event_1.bits.MAX30101_ERROR = 0x01;

						NRF_LOG_INFO("MAX30101_ERROR");

					}

					sensor_data_packet_ready = 0x01;

					battery_read_step = 0x00;

					collection_cycle_update = 0x00;

					data_update_state = 0x01;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();

						gap_params_init();

						advertising_init(data_update_state);

						advertising_start();

					}

					NRF_LOG_INFO("Data Update");

				}

			}

		}

		if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

			if (aggregator_notify_enable_state || stream_notify_enable_state) {

				if (event_packet_ready || sensor_data_packet_ready) {

					if (tx_complete_state == 0x01) {

						tx_complete_state = 0x00;

						if (event_packet_ready == 0x01) {

							build_event_packet(event_type);

						} else if (sensor_data_packet_ready == 0x01) {

							build_sensor_data_packet();

						}

						if (aggregator_notify_enable_state) {

							ble_service_send_aggregator_notification(
									m_conn_handle, &m_service,
									node_packet_data.buffer,
									node_packet_data_size);

							NRF_LOG_INFO("Gateway notify send");

						} else if (stream_notify_enable_state) {

							ble_service_send_stream_notification(m_conn_handle,
									&m_service, node_packet_data.buffer,
									node_packet_data_size);

							NRF_LOG_INFO("Stream notify send");

						}

					} else if (tx_complete_state == 0x02) {

						if (event_packet_ready == 0x01) {

							event_packet_ready = 0x00;

						} else if (sensor_data_packet_ready == 0x01) {

							sensor_data_packet_ready = 0x00;

						}

						if (!event_packet_ready && !sensor_data_packet_ready) {

							data_update_state = 0x00;
							disconnect_timeout_count = DISCONNECT_TIMEOUT;

						} else {

							tx_complete_state = 0x01;

						}

						event_init = 0x01;

					}

				}

				if (stream_notify_enable_state) {

					disconnect_timeout_count = 0;

				}

			}

			disconnect_timeout_count++;

			if (disconnect_timeout_count > DISCONNECT_TIMEOUT) {

				if (request_disconnect == 0x00) {

					sd_ble_gap_disconnect(m_conn_handle,
					BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					request_disconnect = 0x01;

					NRF_LOG_INFO("Disconnect request");

				}

			}

		} else {

			disconnect_timeout_count = 0;

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		nrf_gpio_pin_toggle(GPIO_LED_1);

		NRF_LOG_FLUSH();

	}
}

/**
 * @}
 */
